#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/df7b52cf-72b5-4784-9874-85af8d8adb24/resourceGroups/minecraft-prod-rg]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/df7b52cf-72b5-4784-9874-85af8d8adb24/resourceGroups/minecraft-prod-rg/providers/Microsoft.Storage/storageAccounts/moonenminecraftprod]
azurerm_storage_share.world_share: Refreshing state... [id=https://moonenminecraftprod.file.core.windows.net/world]
azurerm_storage_share.config_share: Refreshing state... [id=https://moonenminecraftprod.file.core.windows.net/config]
azurerm_container_group.containers: Refreshing state... [id=/subscriptions/df7b52cf-72b5-4784-9874-85af8d8adb24/resourceGroups/minecraft-prod-rg/providers/Microsoft.ContainerInstance/containerGroups/minecraft]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_group.containers must be replaced
-/+ resource "azurerm_container_group" "containers" {
      ~ exposed_port        = [
          - {
              - port     = 25565
              - protocol = "TCP"
            },
        ] -> (known after apply)
      ~ fqdn                = "moonenminecraftprod.westeurope.azurecontainer.io" -> (known after apply)
      ~ id                  = "/subscriptions/df7b52cf-72b5-4784-9874-85af8d8adb24/resourceGroups/minecraft-prod-rg/providers/Microsoft.ContainerInstance/containerGroups/minecraft" -> (known after apply)
      ~ ip_address          = "20.229.254.135" -> (known after apply)
        name                = "minecraft"
      - tags                = {} -> null
        # (6 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          ~ environment_variables        = { # forces replacement
              + "GAMEMODE"          = "survival"
              + "SPAWN_ANIMALS"     = "true"
              + "SPAWN_MONSTERS"    = "true"
              + "SPAWN_NPCS"        = "true"
                # (3 unchanged elements hidden)
            }
          - memory_limit                 = 0 -> null
            name                         = "studio"
          - secure_environment_variables = (sensitive value)
            # (3 unchanged attributes hidden)

          ~ volume {
                name                 = "world"
              - secret               = (sensitive value)
                # (6 unchanged attributes hidden)
            }
          ~ volume {
                name                 = "config"
              - secret               = (sensitive value)
                # (6 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rickmoonex, Action: `pull_request`*